nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.h
            cadcConfigStruct.uDisabledSampleSlot.eSimultParallelModeDisSample = kCADC_Sample2_10Disabled;
            cadcConfigStruct.u32ChannelModeMask = kCADC_ANA4_5_FullyDifferential | kCADC_ANA6_7_FullyDifferential |
                                                    kCADC_ANB0_1_FullyDifferential | kCADC_ANB2_3_FullyDifferential;
            cadcConfigStruct.eSampleSlot[0] = kCADC_SingleEndANA4_DiffANA4pANA5n;
            cadcConfigStruct.eSampleSlot[1] = kCADC_SingleEndANA6_DiffANA6pANA7n;
            cadcConfigStruct.eSampleSlot[8] = kCADC_SingleEndANB0_DiffANB0pANB1n;
            cadcConfigStruct.eSampleSlot[9] = kCADC_SingleEndANB2_DiffANB2pANB3n;
            sCadcConfigStruct.sConverterA.bPowerUp   = true;
            sCadcConfigStruct.sConverterA.u16ClockDivisor = 4U; (So ConverterA clock = (peripheral clock / 5).)
            sCadcConfigStruct.sConverterB.bPowerUp   = true;
            sCadcConfigStruct.sConverterB.u16ClockDivisor = 4U; (So ConverterB clock = (peripheral clock / 5).)
            CADC_Init(ADC, &sCadcConfigStruct);
        @endcode
 *  @}
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
#define FSL_CADC_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

#if (defined(ADC_RSLT2_COUNT))
#define CADC_SAMPLE_SLOTS_COUNT (ADC_RSLT_COUNT + ADC_RSLT2_COUNT)
#else
#define CADC_SAMPLE_SLOTS_COUNT (ADC_RSLT_COUNT)
#endif /**/

/*!
 * @brief CADC miscellaneous status flags used to tell peripheral's miscellaneous status, such as zerocrossing, end of
 * scan flags.
 */
enum _cadc_misc_status_flags
{
    kCADC_ZeroCrossingInterruptFlag = ADC_STAT_ZCI_MASK,  /*!< Zero crossing encountered. IRQ pending if
                                                           enabled Zero Crossing Interrupt. */
    kCADC_HighLimitInterruptFlag = ADC_STAT_HLMTI_MASK,   /*!< High limit exceeded flag. IRQ pending if enabled
                                                           high limit interrupt. */
    kCADC_LowLimitInterruptFlag = ADC_STAT_LLMTI_MASK,    /*!< Low limit exceeded flag. IRQ pending if enabled
                                                           low limit interrupt. */
    kCADC_ConverterAInProgressFlag = ADC_STAT_CIP0_MASK,  /*!< Conversion in progress, converter A. */
    kCADC_ConverterBInProgressFlag = ADC_STAT_CIP1_MASK,  /*!< Conversion in progress, converter B. */
    kCADC_ConverterAEndOfScanFlag  = ADC_STAT_EOSI0_MASK, /*!< End of scan, converter A. */
    kCADC_ConverterBEndOfScanFlag  = ADC_STAT_EOSI1_MASK, /*!< End of scan, converter B. */
    kCADC_StatusAllFlags           = kCADC_ZeroCrossingInterruptFlag | kCADC_HighLimitInterruptFlag |
                           kCADC_LowLimitInterruptFlag | kCADC_ConverterAInProgressFlag |
                           kCADC_ConverterBInProgressFlag | kCADC_ConverterAEndOfScanFlag |
                           kCADC_ConverterBEndOfScanFlag,
};

/*!
 * @brief The enumeration of converter power status.
 */
enum _cadc_converter_power_status_flags
{
    kCADC_ConverterAPowerDownFlag = ADC_PWR_PSTS0_MASK, /*!< The converterA is powered down. */
    kCADC_ConverterBPowerDownFlag = ADC_PWR_PSTS1_MASK, /*!< The converterB is powered down. */
};

/*!
 * @brief CADC Interrupts enumeration.
 */
enum _cadc_interrupt_enable
{
    kCADC_Sample0ScanInterruptEnable  = 1UL << 0UL,  /*!< If sample0 is converted, generate the scan interrupt. */
    kCADC_Sample1ScanInterruptEnable  = 1UL << 1UL,  /*!< If sample1 is converted, generate the scan interrupt. */
    kCADC_Sample2ScanInterruptEnable  = 1UL << 2UL,  /*!< If sample2 is converted, generate the scan interrupt. */
    kCADC_Sample3ScanInterruptEnable  = 1UL << 3UL,  /*!< If sample3 is converted, generate the scan interrupt. */
    kCADC_Sample4ScanInterruptEnable  = 1UL << 4UL,  /*!< If sample4 is converted, generate the scan interrupt. */
    kCADC_Sample5ScanInterruptEnable  = 1UL << 5UL,  /*!< If sample5 is converted, generate the scan interrupt. */
    kCADC_Sample6ScanInterruptEnable  = 1UL << 6UL,  /*!< If sample6 is converted, generate the scan interrupt. */
    kCADC_Sample7ScanInterruptEnable  = 1UL << 7UL,  /*!< If sample7 is converted, generate the scan interrupt. */
    kCADC_Sample8ScanInterruptEnable  = 1UL << 8UL,  /*!< If sample8 is converted, generate the scan interrupt. */
    kCADC_Sample9ScanInterruptEnable  = 1UL << 9UL,  /*!< If sample9 is converted, generate the scan interrupt. */
    kCADC_Sample10ScanInterruptEnable = 1UL << 10UL, /*!< If sample10 is converted, generate the scan interrupt. */
    kCADC_Sample11ScanInterruptEnable = 1UL << 11UL, /*!< If sample11 is converted, generate the scan interrupt. */
    kCADC_Sample12ScanInterruptEnable = 1UL << 12UL, /*!< If sample12 is converted, generate the scan interrupt. */
    kCADC_Sample13ScanInterruptEnable = 1UL << 13UL, /*!< If sample13 is converted, generate the scan interrupt. */
    kCADC_Sample14ScanInterruptEnable = 1UL << 14UL, /*!< If sample14 is converted, generate the scan interrupt. */
    kCADC_Sample15ScanInterruptEnable = 1UL << 15UL, /*!< If sample15 is converted, generate the scan interrupt. */
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    kCADC_Sample16ScanInterruptEnable = 1UL << 16UL, /*!< If sample16 is converted, generate the scan interrupt. */
    kCADC_Sample17ScanInterruptEnable = 1UL << 17UL, /*!< If sample17 is converted, generate the scan interrupt. */
    kCADC_Sample18ScanInterruptEnable = 1UL << 18UL, /*!< If sample18 is converted, generate the scan interrupt. */
    kCADC_Sample19ScanInterruptEnable = 1UL << 19UL, /*!< If sample19 is converted, generate the scan interrupt. */
#endif                                               /* FSL_FEATURE_CADC_RSLT2_COUNT */

    kCADC_HighLimitInterruptEnable = ((uint32_t)ADC_CTRL1_HLMTIE_MASK << 16UL),  /*!< If the result value
                                                                                         is greater than the high
                                                                                         limit value, generate high
                                                                                         limit interrupt.  */
    kCADC_LowLimitInterruptEnable = ((uint32_t)ADC_CTRL1_LLMTIE_MASK << 16UL),   /*!< If the result value
                                                                                         is less than the low limit
                                                                                         value, generate low limit
                                                                                         interrupt. */
    kCADC_ZeroCrossingInterruptEnable = ((uint32_t)ADC_CTRL1_ZCIE_MASK << 16UL), /*!< If the current value has a sign
                                                                change from  the previous result in the selected zero
                                                                crossing mode, generate the zero crossing mode */

    kCADC_ConversionCompleteInterrupt0Enable = ((uint32_t)ADC_CTRL1_EOSIE0_MASK << 16UL), /*!< Upon the completion of
                                                                              the scan, generate the end of scan
                                                                              interrupt, when the scan mode is selected
                                                                              as sequential mode or simultaneous
                                                                              parallel mode. For looping scan mode, the
                                                                              interrupt will trigger after the
                                                                              completion of each iteration of loop. */
    kCADC_ConversionCompleteInterrupt1Enable = ((uint32_t)ADC_CTRL2_EOSIE1_MASK << 12UL), /*!< When the scan mode is
                                                                              independent parallel mode, up the
                                                                              completion of the converter scan, generate
                                                                              te end of scan interrupt. For looping scan
                                                                              mode, the interrupt will trigger after the
                                                                              completion of each iteration of loop. */
    kCADC_ALLInterruptEnable =
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
        kCADC_Sample16ScanInterruptEnable | kCADC_Sample17ScanInterruptEnable | kCADC_Sample18ScanInterruptEnable |
        kCADC_Sample19ScanInterruptEnable |
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
        kCADC_Sample0ScanInterruptEnable | kCADC_Sample1ScanInterruptEnable | kCADC_Sample2ScanInterruptEnable |
        kCADC_Sample3ScanInterruptEnable | kCADC_Sample4ScanInterruptEnable | kCADC_Sample5ScanInterruptEnable |
        kCADC_Sample6ScanInterruptEnable | kCADC_Sample7ScanInterruptEnable | kCADC_Sample8ScanInterruptEnable |
        kCADC_Sample9ScanInterruptEnable | kCADC_Sample10ScanInterruptEnable | kCADC_Sample11ScanInterruptEnable |
        kCADC_Sample12ScanInterruptEnable | kCADC_Sample13ScanInterruptEnable | kCADC_Sample14ScanInterruptEnable |
        kCADC_Sample15ScanInterruptEnable | kCADC_HighLimitInterruptEnable | kCADC_LowLimitInterruptEnable |
        kCADC_ZeroCrossingInterruptEnable | kCADC_ConversionCompleteInterrupt0Enable |
        kCADC_ConversionCompleteInterrupt1Enable,
};

/*!
 * @brief CADC Converter identifier.
 */
typedef enum _cadc_converter_id
{
    kCADC_ConverterA = 0x1U, /*!< Converter A. */
    kCADC_ConverterB = 0x2U, /*!< Converter B. */
} cadc_converter_id_t;

/*!
 * @brief The enumeration of work mode when the module is not used.
 */
typedef enum _cadc_idle_work_mode
{
    kCADC_IdleKeepNormal = 0U, /*!< Keep normal. */
#if !(defined(FSL_FEATURE_CADC_NO_AUTO_STANDBY) && FSL_FEATURE_CADC_NO_AUTO_STANDBY)
    kCADC_IdleAutoStandby,   /*!< Fall into standby mode automatically. */
#endif                       /* FSL_FEATURE_CADC_NO_AUTO_STANDBY */
    kCADC_IdleAutoPowerDown, /*!< Fall into power down mode automatically. */
} cadc_idle_work_mode_t;

/*!
 * @brief The enumeration of DMA trigger source.
 */
typedef enum _cadc_dma_trigger_source
{
    kCADC_DMATrigSrcEndofScan   = 0U, /*!< DMA trigger source is end of scan interrupt. */
    kCADC_DMATrigSrcSampleReady = 1U, /*!< DMA trigger source is RDY bits. */
} cadc_dma_trigger_source_t;

/*!
 * @brief The enumeration of dual converter's scan mode.
 */
typedef enum _cadc_scan_mode
{
    kCADC_ScanModeOnceSequential                = 0U,       /*!< Once (single) sequential. */
    kCADC_ScanModeOnceParallelIndependent       = 1U,       /*!< Once parallel independently. */
    kCADC_ScanModeLoopSequential                = 2U,       /*!< Loop sequential. */
    kCADC_ScanModeLoopParallelIndependent       = 3U,       /*!< Loop parallel independently. */
    kCADC_ScanModeTriggeredSequential           = 4U,       /*!< Triggered sequential. */
    kCADC_ScanModeTriggeredParallelIndependent  = 5U,       /*!< Triggered parallel independently. */
    kCADC_ScanModeOnceParallelSimultaneous      = 1U << 4U, /*!< Once parallel simultaneously. */
    kCADC_ScanModeLoopParallelSimultaneous      = 3U << 4U, /*!< Loop parallel simultaneously. */
    kCADC_ScanModeTriggeredParallelSimultaneous = 5U << 4U, /*!< Triggered parallel simultaneously. */
} cadc_scan_mode_t;

#if !(defined(FSL_FEATURE_CADC_NO_SPEEDMODE_BIT) && FSL_FEATURE_CADC_NO_SPEEDMODE_BIT)
/*!
 * @brief The enumeration of the converter's speed mode.
 */
typedef enum _cadc_speed_mode
{
    kCADC_ClkFreqBelow6P25MHz = 0U,  /*!< Conversion clock frequency <= 6.25 MHz;
                                        current consumption per converter = 6 mA. */
    kCADC_ClkFreqBelow12P25MHz = 1U, /*!< Conversion clock frequency <= 12.25 MHz;
                                         current consumption per converter = 10.8 mA. */
    kCADC_ClkFreqBelow18P75MHz = 2U, /*!< Conversion clock frequency <= 18.75 MHz;
                                         current consumption per converter = 18 mA. */
    kCADC_ClkFreqBelow25MHz = 3U,    /*!< Conversion clock frequency <= 25 MHz;
                                         current consumption per converter = 25.2 mA. */
} cadc_speed_mode_t;
