nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.h
#endif /*FSL_FEATURE_CADC_NO_SPEEDMODE_BIT */

/*!
 * @brief The enumeration of converter's reference voltage source.
 */
typedef enum _cadc_reference_voltage_source
{
    kCADC_ReferenceVoltageVrefPad    = 0U, /*!< VREF pin. */
    kCADC_ReferenceVoltageChannelPad = 1U, /*!< ANx2 or ANx3 pin. */
} cadc_reference_voltage_source_t;

/*!
 * @brief The enumeration of sample slot connected channel gain.
 */
typedef enum _cadc_channel_gain
{
    kCADC_SignalGainX1 = 0U, /*!< Gain x1. */
    kCADC_SignalGainX2 = 1U, /*!< Gain x2. */
    kCADC_SignalGainX4 = 2U, /*!< Gain x4. */
} cadc_channel_gain_t;

/*!
 * @brief The enumeration of all channels' channel mode.
 */
typedef enum _cadc_channel_mode
{
    /* The following three enumeration members are mutually exclusive */
    kCADC_ANA0_1_SingleEnd         = 1UL << 0UL, /*!< ANA0 and ANA1 both configured as single ended inputs. */
    kCADC_ANA0_1_FullyDifferential = 2UL << 0UL, /*!< ANA0 configured as fully differential positive input,
                                                     ANA1 configured as fully differential negative input. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_ANA0_1_UnipolarDifferential = 3UL << 0UL, /*!< ANA0 configured as unipolar differential positive input,
                                                        ANA1 configured as unipolar differential negative input. */
#endif                                              /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */

    /* The following three enumeration members are mutually exclusive */
    kCADC_ANA2_3_SingleEnd         = 1UL << 3UL, /*!< ANA2 and ANA3 both configured as single ended inputs. */
    kCADC_ANA2_3_FullyDifferential = 2UL << 3UL, /*!< ANA2 configured as fully differential positive input,
                                                     ANA3 configured as fully differential negative input. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_ANA2_3_UnipolarDifferential = 3UL << 3UL, /*!< ANA2 configured as unipolar differential positive input,
                                                        ANA3 configured as unipolar differential negative input. */
#endif                                              /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */

    /* The following three enumeration members are mutually exclusive */
    kCADC_ANB0_1_SingleEnd         = 1UL << 6UL, /*!< ANB0 and ANB1 both configured as single ended inputs. */
    kCADC_ANB0_1_FullyDifferential = 2UL << 6UL, /*!< ANB0 configured as fully differential positive input,
                                                     ANB1 configured as fully differential negative input. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_ANB0_1_UnipolarDifferential = 3UL << 6UL, /*!< ANB0 configured as unipolar differential positive input,
                                                        ANB1 configured as unipolar differential negative input. */
#endif                                              /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */

    /* The following three enumeration members are mutually exclusive */
    kCADC_ANB2_3_SingleEnd         = 1UL << 9UL, /*!< ANB2 and ANB3 both configured as single ended inputs. */
    kCADC_ANB2_3_FullyDifferential = 2UL << 9UL, /*!< ANB2 configured as fully differential positive input,
                                                     ANB3 configured as fully differential negative input. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_ANB2_3_UnipolarDifferential = 3UL << 9UL, /*!< ANB2 configured as unipolar differential positive input,
                                                        ANB3 configured as unipolar differential negative input. */
#endif                                              /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */

    /* The following three enumeration members are mutually exclusive */
    kCADC_ANA4_5_SingleEnd         = 1UL << 12UL, /*!< ANA4 and ANA5 both configured as single ended inputs. */
    kCADC_ANA4_5_FullyDifferential = 2UL << 12UL, /*!< ANA4 configured as fully differential positive input,
                                                      ANA5 configured as fully differential negative input. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_ANA4_5_UnipolarDifferential = 3UL << 12UL, /*!< ANA4 configured as unipolar differential positive input,
                                                         ANA5 configured as unipolar differential negative input. */
#endif                                               /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */

    /* The following six enumeration members are mutually exclusive */
    kCADC_ANA6_7_SingleEnd         = 1UL << 15UL, /*!< ANA6 and ANA7 both configured as single ended inputs. */
    kCADC_ANA6_7_FullyDifferential = 2UL << 15UL, /*!< ANA6 configured as fully differential positive input,
                                                  ANA7 configured as fully differential negative input. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_ANA6_7_UnipolarDifferential = 3UL << 15UL, /*!< ANA6 configured as unipolar differential positive input,
                                                     ANA7 configured as unipolar differential negative input. */
#endif                                               /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_ANA6_InternalTempSensor_ANA7_Normal = 4UL << 15UL,  /*!< ANA6 configured as Internal temperature sensor,
                                                                  ANA7 configured as normal single-end operate mode. */
    kCADC_ANA6_Normal_ANA7_InternalAnalogInput = 5UL << 15UL, /*!< ANA6 configured as normal single-end operate mode,
                                                                  ANA7 configuread as internal analog input */
    kCADC_ANA6_InternalTempSensor_ANA7_InternalAnalogInput = 6UL << 15UL, /*!< ANA6 configured as internal temperature
                                                                    sensor, ANA7 configured as internal analog input. */
#endif                                                                    /* FSL_FEATURE_CADC_RSLT2_COUNT */

    /* The following three enumeration members are mutually exclusive */
    kCADC_ANB4_5_SingleEnd         = 1UL << 18UL, /*!< ANB4 and ANB5 both configured as single ended inputs. */
    kCADC_ANB4_5_FullyDifferential = 2UL << 18UL, /*!< ANB4 configured as fully differential positive input,
                                                  ANB5 configured as fully differential negative input. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_ANB4_5_UnipolarDifferential = 3UL << 18UL, /*!< ANB4 configured as unipolar differential positive input,
                                                 ANB5 configured as unipolar differential negative input. */
#endif                                               /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */

    /* The following six enumeration members are mutually exclusive */
    kCADC_ANB6_7_SingleEnd         = 1UL << 21UL, /*!< ANB6 and ANB7 both configured as single ended inputs. */
    kCADC_ANB6_7_FullyDifferential = 2UL << 21UL, /*!< ANB6 configured as fully differential positive input,
                                              ANB7 configured as fully differential negative input. */
#if (defined(FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE) && FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE)
    kCADC_ANB6_7_UnipolarDifferential = 3UL << 21UL, /*!< ANB6 configured as unipolar differential positive input,
                                                 ANB7 configured as unipolar differential negative input. */
#endif                                               /* FSL_FEATURE_CADC_HAS_UNIPOLAR_DIFFERENTIAL_MODE */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_ANB6_InternalTempSensor_ANB7_Normal = 4UL << 21UL,  /*!< ANB6 configured as internal temperature sensor,
                                                                  ANB7 configured as normal single-end operate mode. */
    kCADC_ANB6_Normal_ANB7_InternalAnalogInput = 5UL << 21UL, /*!< ANB6 configured as normal single-end operate mode,
                                                                  ANB7 configuread as internal analog input */
    kCADC_ANB6_InternalTempSensor_ANB7_InternalAnalogInput = 6UL << 21UL, /*!< ANB6 configured as internal temperature
                                                                    sensor, ANB7 configured as internal analog input. */
#endif                                                                    /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_channel_mode_t;

/*!
 * @brief The enumerator of all channels that can be routed to the specific sample slot.
 */
typedef enum _cadc_channel_number
{
    kCADC_SingleEndANA0_DiffANA0pANA1n = 0U,  /*!< Single Endned ANA0 Signal Or Differential ANA0+, ANA1- signal. */
    kCADC_SingleEndANA1_DiffANA0pANA1n = 1U,  /*!< Single Endned ANA1 Signal Or Differential ANA0+, ANA1- signal. */
    kCADC_SingleEndANA2_DiffANA2pANA3n = 2U,  /*!< Single Endned ANA2 Signal Or Differential ANA2+, ANA3- signal. */
    kCADC_SingleEndANA3_DiffANA2pANA3n = 3U,  /*!< Single Endned ANA3 Signal Or Differential ANA2+, ANA3- signal. */
    kCADC_SingleEndANA4_DiffANA4pANA5n = 4U,  /*!< Single Endned ANA4 Signal Or Differential ANA4+, ANA5- signal. */
    kCADC_SingleEndANA5_DiffANA4pANA5n = 5U,  /*!< Single Endned ANA5 Signal Or Differential ANA4+, ANA5- signal. */
    kCADC_SingleEndANA6_DiffANA6pANA7n = 6U,  /*!< Single Endned ANA6 Signal Or Differential ANA6+, ANA7- signal. */
    kCADC_SingleEndANA7_DiffANA6pANA7n = 7U,  /*!< Single Endned ANA7 Signal Or Differential ANA6+, ANA7- signal. */
    kCADC_SingleEndANB0_DiffANB0pANB1n = 8U,  /*!< Single Endned ANB0 Signal Or Differential ANB0+, ANB1- signal. */
    kCADC_SingleEndANB1_DiffANB0pANB1n = 9U,  /*!< Single Endned ANB1 Signal Or Differential ANB0+, ANB1- signal. */
    kCADC_SingleEndANB2_DiffANB2pANB3n = 10U, /*!< Single Endned ANB2 Signal Or Differential ANB2+, ANB3- signal. */
    kCADC_SingleEndANB3_DiffANB2pANB3n = 11U, /*!< Single Endned ANB3 Signal Or Differential ANB2+, ANB3- signal. */
    kCADC_SingleEndANB4_DiffANB4pANB5n = 12U, /*!< Single Endned ANB4 Signal Or Differential ANB4+, ANB5- signal. */
    kCADC_SingleEndANB5_DiffANB4pANB5n = 13U, /*!< Single Endned ANB5 Signal Or Differential ANB4+, ANB5- signal. */
    kCADC_SingleEndANB6_DiffANB6pANB7n = 14U, /*!< Single Endned ANB6 Signal Or Differential ANB6+, ANB7- signal. */
    kCADC_SingleEndANB7_DiffANB6pANB7n = 15U, /*!< Single Endned ANB7 Signal Or Differential ANB6+, ANB7- signal. */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_ADCATemperatureSensor = 16U, /*!< Single Ended ADCA Temperature sensor. */
    kCADC_ADCAAnalogInput       = 17U, /*!< Single Ended ADCA analog input for on-chip generated signals. */
    kCADC_ADCBTemperatureSensor = 18U, /*!< Single Ended ADCB Temperature sensor. */
    kCADC_ADCBAnalogInput       = 19U, /*!< Single Ended ADCB analog input for on-chip generated signals. */
#endif                                 /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_channel_number_t;

/*!
 * @brief The enumeration of sample slot mask.
 */
typedef enum _cadc_sample_slot_mask
{
    kCADC_NonSampleSlotMask = 0UL,

    kCADC_SampleSlot0Mask  = 1UL << 0UL,  /*!< The mask of sample slot0. */
    kCADC_SampleSlot1Mask  = 1UL << 1UL,  /*!< The mask of sample slot1. */
    kCADC_SampleSlot2Mask  = 1UL << 2UL,  /*!< The mask of sample slot2. */
    kCADC_SampleSlot3Mask  = 1UL << 3UL,  /*!< The mask of sample slot3. */
    kCADC_SampleSlot4Mask  = 1UL << 4UL,  /*!< The mask of sample slot4. */
    kCADC_SampleSlot5Mask  = 1UL << 5UL,  /*!< The mask of sample slot5. */
    kCADC_SampleSlot6Mask  = 1UL << 6UL,  /*!< The mask of sample slot6. */
    kCADC_SampleSlot7Mask  = 1UL << 7UL,  /*!< The mask of sample slot7. */
    kCADC_SampleSlot8Mask  = 1UL << 8UL,  /*!< The mask of sample slot8. */
    kCADC_SampleSlot9Mask  = 1UL << 9UL,  /*!< The mask of sample slot9. */
    kCADC_SampleSlot10Mask = 1UL << 10UL, /*!< The mask of sample slot10. */
    kCADC_SampleSlot11Mask = 1UL << 11UL, /*!< The mask of sample slot11. */
    kCADC_SampleSlot12Mask = 1UL << 12UL, /*!< The mask of sample slot12. */
    kCADC_SampleSlot13Mask = 1UL << 13UL, /*!< The mask of sample slot13. */
    kCADC_SampleSlot14Mask = 1UL << 14UL, /*!< The mask of sample slot14. */
    kCADC_SampleSlot15Mask = 1UL << 15UL, /*!< The mask of sample slot15. */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_SampleSlot16Mask = 1UL << 16UL, /*!< The mask of sample slot16. */
    kCADC_SampleSlot17Mask = 1UL << 17UL, /*!< The mask of sample slot17. */
    kCADC_SampleSlot18Mask = 1UL << 18UL, /*!< The mask of sample slot18. */
    kCADC_SampleSlot19Mask = 1UL << 19UL, /*!< The mask of sample slot19. */
#endif                                    /* FSL_FEATURE_CADC_RSLT2_COUNT */

#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_AllSampleSlotsMask = 0xFFFFFUL, /*!< The mask of all sample slots. */
#else
    kCADC_AllSampleSlotsMask = 0xFFFFUL, /*!< The mask of all sample slots. */
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_sample_slot_mask_t;

/*!
 * @brief The enumeration of sample slot index.
 */
typedef enum _cadc_sample_slot_index
{
    kCADC_SampleSlot0Index  = 0U,  /*!< The index of sample slot0. */
    kCADC_SampleSlot1Index  = 1U,  /*!< The index of sample slot1. */
    kCADC_SampleSlot2Index  = 2U,  /*!< The index of sample slot2. */
    kCADC_SampleSlot3Index  = 3U,  /*!< The index of sample slot3. */
    kCADC_SampleSlot4Index  = 4U,  /*!< The index of sample slot4. */
    kCADC_SampleSlot5Index  = 5U,  /*!< The index of sample slot5. */
    kCADC_SampleSlot6Index  = 6U,  /*!< The index of sample slot6. */
    kCADC_SampleSlot7Index  = 7U,  /*!< The index of sample slot7. */
    kCADC_SampleSlot8Index  = 8U,  /*!< The index of sample slot8. */
    kCADC_SampleSlot9Index  = 9U,  /*!< The index of sample slot9. */
    kCADC_SampleSlot10Index = 10U, /*!< The index of sample slot10. */
    kCADC_SampleSlot11Index = 11U, /*!< The index of sample slot11. */
    kCADC_SampleSlot12Index = 12U, /*!< The index of sample slot12. */
    kCADC_SampleSlot13Index = 13U, /*!< The index of sample slot13. */
    kCADC_SampleSlot14Index = 14U, /*!< The index of sample slot14. */
    kCADC_SampleSlot15Index = 15U, /*!< The index of sample slot15. */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_SampleSlot16Index = 16U, /*!< The index of sample slot16. */
    kCADC_SampleSlot17Index = 17U, /*!< The index of sample slot17. */
    kCADC_SampleSlot18Index = 18U, /*!< The index of sample slot18. */
    kCADC_SampleSlot19Index = 19U, /*!< The index of sample slot19. */
#endif                             /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_sample_slot_index_t;

/*!
 * @brief The enumeration for the sample slot to be disabled in sequential mode.
 */
typedef enum _cadc_sample_slot_sequential_mode_disabled
{
    kCADC_Sample0Disabled = 1UL << 0UL,   /*!< Disable Sample slot0, the scan will stop at sample slot0
                                              in sequential scan mode */
    kCADC_Sample1Disabled = 1UL << 1UL,   /*!< Disable Sample slot1, the scan will stop at sample slot1
                                                in sequential scan mode */
    kCADC_Sample2Disabled = 1UL << 2UL,   /*!< Disable Sample slot2, the scan will stop at sample slot2
                                              in sequential scan mode */
    kCADC_Sample3Disabled = 1UL << 3UL,   /*!< Disable Sample slot3, the scan will stop at sample slot3
                                                in sequential scan mode */
    kCADC_Sample4Disabled = 1UL << 4UL,   /*!< Disable Sample slot4, the scan will stop at sample slot4
                                              in sequential scan mode */
    kCADC_Sample5Disabled = 1UL << 5UL,   /*!< Disable Sample slot5, the scan will stop at sample slot5
                                                in sequential scan mode */
    kCADC_Sample6Disabled = 1UL << 6UL,   /*!< Disable Sample slot6, the scan will stop at sample slot6
                                              in sequential scan mode */
    kCADC_Sample7Disabled = 1UL << 7UL,   /*!< Disable Sample slot7, the scan will stop at sample slot7
                                                in sequential scan mode */
    kCADC_Sample8Disabled = 1UL << 8UL,   /*!< Disable Sample slot8, the scan will stop at sample slot8
                                              in sequential scan mode */
    kCADC_Sample9Disabled = 1UL << 9UL,   /*!< Disable Sample slot9, the scan will stop at sample slot9
                                                in sequential scan mode */
    kCADC_Sample10Disabled = 1UL << 10UL, /*!< Disable Sample slot10, the scan will stop at sample slot10
                                            in sequential scan mode */
    kCADC_Sample11Disabled = 1UL << 11UL, /*!< Disable Sample slot11, the scan will stop at sample slot11
                                              in sequential scan mode */
    kCADC_Sample12Disabled = 1UL << 12UL, /*!< Disable Sample slot12, the scan will stop at sample slot12
                                              in sequential scan mode */
    kCADC_Sample13Disabled = 1UL << 13UL, /*!< Disable Sample slot13, the scan will stop at sample slot13
                                            in sequential scan mode */
    kCADC_Sample14Disabled = 1UL << 14UL, /*!< Disable Sample slot14, the scan will stop at sample slot14
                                              in sequential scan mode */
    kCADC_Sample15Disabled = 1UL << 15UL, /*!< Disable Sample slot15, the scan will stop at sample slot15
                                            in sequential scan mode */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_Sample16Disabled = 1UL << 16UL, /*!< Disable Sample slot16, the scan will stop at sample slot16
                                              in sequential scan mode */
    kCADC_Sample17Disabled = 1UL << 17UL, /*!< Disable Sample slot17, the scan will stop at sample slot17
                                              in sequential scan mode */
    kCADC_Sample18Disabled = 1UL << 18UL, /*!< Disable Sample slot18, the scan will stop at sample slot18
                                              in sequential scan mode */
    kCADC_Sample19Disabled = 1UL << 19UL, /*!< Disable Sample slot19, the scan will stop at sample slot19
                                            in sequential scan mode */
#endif                                    /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_sample_slot_sequential_mode_disabled_t;

/*!
 * @brief The enumeration for the sample slot to be disabled in simultaneous parallel mode.
 */
typedef enum _cadc_sample_slot_simultParallel_mode_disabled
{
    kCADC_Sample0_8Disabled = 1UL << 0UL, /*!< Disable Sample slot0 and Sample Slot 8, in the simultaneous parallel mode
                                         the converter A and converter B will stop at Sample slot0 and Sample slot 8. */
    kCADC_Sample1_9Disabled = 1UL << 1UL, /*!< Disable Sample slot1 and Sample Slot 9, in the simultaneous parallel mode
                                         the converter A and converter B will stop at Sample slot1 and Sample slot 9. */
    kCADC_Sample2_10Disabled = 1UL << 2UL, /*!< Disable Sample slot2 and Sample Slot 10,
                                                in the simultaneous parallel mode the converter A
                                                and converter B will stop at Sample slot2 and Sample slot 10. */
    kCADC_Sample3_11Disabled = 1UL << 3UL, /*!< Disable Sample slot3 and Sample Slot 11,
                                            in the simultaneous parallel mode the converter A
                                            and converter B will stop at Sample slot3 and Sample slot 11. */
    kCADC_Sample4_12Disabled = 1UL << 4UL, /*!< Disable Sample slot4 and Sample Slot 12,
                                                in the simultaneous parallel mode the converter A
                                                and converter B will stop at Sample slot4 and Sample slot 12. */
    kCADC_Sample5_13Disabled = 1UL << 5UL, /*!< Disable Sample slot5 and Sample Slot 13,
                                                in the simultaneous parallel mode the converter A
                                                and converter B will stop at Sample slot5 and Sample slot 13. */
    kCADC_Sample6_14Disabled = 1UL << 6UL, /*!< Disable Sample slot6 and Sample Slot 14,
                                                in the simultaneous parallel mode the converter A
                                                and converter B will stop at Sample slot7 and Sample slot 14. */
    kCADC_Sample7_15Disabled = 1UL << 7UL, /*!< Disable Sample slot7 and Sample Slot 15,
                                                in the simultaneous parallel mode the converter A
                                                and converter B will stop at Sample slot7 and Sample slot 15. */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_Sample16_18Disabled = 1UL << 16UL, /*!< Disable Sample slot16 and Sample Slot 18,
                                                    in the simultaneous parallel mode the converter A
                                                    and converter B will stop at Sample slot16 and Sample slot 18. */
    kCADC_Sample17_19Disabled = 1UL << 17UL, /*!< Disable Sample slot17 and Sample Slot 19,
                                                    in the simultaneous parallel mode the converter A
                                                    and converter B will stop at Sample slot17 and Sample slot 19. */
#endif                                       /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_sample_slot_simultParallel_mode_disabled_t;

