nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.h
/*!
 * @brief The enumeration for the sample slot to be disabled for the converter A in independent parallel mode.
 */
typedef enum _cadc_sample_slot_independentParallel_mode_convA_disabled
{
    kCADC_ConvASample0Disabled = 1U << 0U, /*!< Disable Sample slot0, the scan will stop at sample slot0
                                            in sequential scan mode */
    kCADC_ConvASample1Disabled = 1U << 1U, /*!< Disable Sample slot1, the scan will stop at sample slot1
                                              in sequential scan mode */
    kCADC_ConvASample2Disabled = 1U << 2U, /*!< Disable Sample slot2, the scan will stop at sample slot2
                                            in sequential scan mode */
    kCADC_ConvASample3Disabled = 1U << 3U, /*!< Disable Sample slot3, the scan will stop at sample slot3
                                              in sequential scan mode */
    kCADC_ConvASample4Disabled = 1U << 4U, /*!< Disable Sample slot4, the scan will stop at sample slot4
                                            in sequential scan mode */
    kCADC_ConvASample5Disabled = 1U << 5U, /*!< Disable Sample slot5, the scan will stop at sample slot5
                                              in sequential scan mode */
    kCADC_ConvASample6Disabled = 1U << 6U, /*!< Disable Sample slot6, the scan will stop at sample slot6
                                            in sequential scan mode */
    kCADC_ConvASample7Disabled = 1U << 7U, /*!< Disable Sample slot7, the scan will stop at sample slot7
                                              in sequential scan mode */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_ConvASample16Disabled = (1U << (16U - 8U)), /*!< Disable Sample slot16, the scan will stop at sample slot16
                                              in sequential scan mode */
    kCADC_ConvASample17Disabled = (1U << (17U - 8U)), /*!< Disable Sample slot17, the scan will stop at sample slot17
                                              in sequential scan mode */
#endif                                                /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_sample_slot_independentParallel_mode_convA_disabled_t;

/*!
 * @brief The enumeration for the sample slot to be disabled for the converter B in independent parallel mode.
 */
typedef enum _cadc_sample_slot_indParallel_mode_convB_disabled
{
    kCADC_ConvBSample8Disabled = (1UL << (8U - 8U)),    /*!< Disable Sample slot8, the scan will stop at sample slot8
                                               in sequential scan mode */
    kCADC_ConvBSample9Disabled = (1UL << (9U - 8U)),    /*!< Disable Sample slot9, the scan will stop at sample slot9
                                                 in sequential scan mode */
    kCADC_ConvBSample10Disabled = (1UL << (10U - 8U)),  /*!< Disable Sample slot10, the scan will stop at sample slot10
                                             in sequential scan mode */
    kCADC_ConvBSample11Disabled = (1UL << (11U - 8U)),  /*!< Disable Sample slot11, the scan will stop at sample slot11
                                               in sequential scan mode */
    kCADC_ConvBSample12Disabled = (1UL << (12U - 8UL)), /*!< Disable Sample slot12, the scan will stop at sample slot12
                                              in sequential scan mode */
    kCADC_ConvBSample13Disabled = (1UL << (13U - 8U)),  /*!< Disable Sample slot13, the scan will stop at sample slot13
                                             in sequential scan mode */
    kCADC_ConvBSample14Disabled = (1UL << (14U - 8U)),  /*!< Disable Sample slot14, the scan will stop at sample slot14
                                               in sequential scan mode */
    kCADC_ConvBSample15Disabled = (1UL << (15U - 8U)),  /*!< Disable Sample slot15, the scan will stop at sample slot15
                                             in sequential scan mode */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    kCADC_ConvBSample18Disabled = (1UL << (18U - 8U)), /*!< Disable Sample slot18, the scan will stop at sample slot18
                                              in sequential scan mode */
    kCADC_ConvBSample19Disabled = (1UL << (19U - 8U)), /*!< Disable Sample slot19, the scan will stop at sample slot19
                                            in sequential scan mode */
#endif                                                 /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_sample_slot_independentParallel_mode_convB_disabled_t;

/*!
 * @brief The enumeration for the sample slot's zero crossing event.
 */
typedef enum _cadc_sample_slot_zero_crossing_mode
{
    kCADC_ZeroCrossingDisabled          = 0U, /*!< Zero Crossing disabled. */
    kCADC_ZeroCrossingForPtoNSign       = 1U, /*!< Zero Crossing enabled for positive to negative sign change. */
    kCADC_ZeroCrossingForNtoPSign       = 2U, /*!< Zero Crossing enabled for negative to positive sign change. */
    kCADC_ZeroCrossingForAnySignChanged = 3U, /*!< Zero Crossing enabled for any sign change. */
} cadc_sample_slot_zero_crossing_mode_t;

/*!
 * @brief The structure of the disabled sample slots in independent parallel mode.
 */
typedef struct _cadc_sample_slot_independentParallel_mode_disabled
{
    cadc_sample_slot_independentParallel_mode_convA_disabled_t eConverterA; /*!< The sample slot to be
                                                                        disabled for the converter A, when the scan mode
                                                                        is set as independent parallel mode. */
    cadc_sample_slot_independentParallel_mode_convB_disabled_t eConverterB; /*!< The sample slot to be
                                                                        disabled for the converter B, when the scan mode
                                                                        is set as independent parallel mode. */
} cadc_sample_slot_independentParallel_mode_disabled_t;

/*!
 * @brief The union of disabled sample slot for each scan mode.
 */
typedef union _cadc_sample_slot_disabled
{
    uint32_t u32SampleDisVal; /*!< The 32 bits width of disabled sample slot value.
                                            This member used to get the disabled sample slot
                                            which sets in different scan modes in word type.
                                            This member is not recommended to be used to set
                                            the disabled sample slot. This member is designed
                                            to be used in driver level only, the application
                                            should not use this member. */
    cadc_sample_slot_sequential_mode_disabled_t eSequentialModeDisSample;         /*!< If the scan mode is selected as
                                                                                sequential mode, the application
                                                                                must use this member to set the disabled
                                                                                sample slot. This member is used to set
                                                                                disabled sample slot when the scan mode is
                                                                                selected as sequential mode. The scan will
                                                                                stop at the first disabled sample slot in
                                                                                that mode. So for the application, this
                                                                                member should be set as one sample slot
                                                                                index that the scan will stop. */
    cadc_sample_slot_simultParallel_mode_disabled_t eSimultParallelModeDisSample; /*!< In simultaneous parallel scan
                                                                        mode, the application must use this member to
                                                                        set the disabled sample slot. In that scan mode,
                                                                        the scan will stop when either converter
                                                                        encounters a disabled sample. */
    cadc_sample_slot_independentParallel_mode_disabled_t sIndependentParallelModeDisSample; /*!< In independent parallel
                                                                    scan mode, the application must use this member to
                                                                    set the disabled sample slot. In that scan mode, the
                                                                    converter will stop scan when it encounters a
                                                                    disabled sample slot. In this mode, the disabled
                                                                    sample slot for converterA and converterB may
                                                                    different.*/
} cadc_sample_slot_disabled_t;

/*!
 * @brief The structure for configuring the sample slot.
 */
typedef struct _cadc_sample_config
{
    cadc_sample_slot_zero_crossing_mode_t eZeroCrossingMode; /*!< Zero crossing mode. */
    uint16_t u16HighLimitValue; /*!< High limit value. Original value formation as hardware register,
                                       with 3-bits left shifted. */
    uint16_t u16LowLimitValue;  /*!< Low limit value. Original value formation as
                                       hardware register, with 3-bits left shifted. */
    uint16_t u16OffsetValue;    /*!< Offset value. Original value formation as hardware register, with
                                       3-bits left shifted. */
} cadc_sample_slot_config_t;

/*!
 * @brief Cadc scan control for sequential scan mode.
 *
 * @note Each member of this structure represent one bit of the word.
 *       Asserted the structure's member means delay sample until a new sync input occurs. Cleared
 *       the structure's member means perform sample immediately after the completion of the current sample.
 *
 */
typedef struct _cadc_scan_ctrl_sequential_mode
{
    uint32_t bitSample0 : 1U;  /*!< Control whether delay sample0 until a new sync input occurs. */
    uint32_t bitSample1 : 1U;  /*!< Control whether delay sample1 until a new sync input occurs. */
    uint32_t bitSample2 : 1U;  /*!< Control whether delay sample2 until a new sync input occurs. */
    uint32_t bitSample3 : 1U;  /*!< Control whether delay sample3 until a new sync input occurs. */
    uint32_t bitSample4 : 1U;  /*!< Control whether delay sample4 until a new sync input occurs. */
    uint32_t bitSample5 : 1U;  /*!< Control whether delay sample5 until a new sync input occurs. */
    uint32_t bitSample6 : 1U;  /*!< Control whether delay sample6 until a new sync input occurs. */
    uint32_t bitSample7 : 1U;  /*!< Control whether delay sample7 until a new sync input occurs. */
    uint32_t bitSample8 : 1U;  /*!< Control whether delay sample8 until a new sync input occurs. */
    uint32_t bitSample9 : 1U;  /*!< Control whether delay sample9 until a new sync input occurs. */
    uint32_t bitSample10 : 1U; /*!< Control whether delay sample10 until a new sync input occurs. */
    uint32_t bitSample11 : 1U; /*!< Control whether delay sample11 until a new sync input occurs. */
    uint32_t bitSample12 : 1U; /*!< Control whether delay sample12 until a new sync input occurs. */
    uint32_t bitSample13 : 1U; /*!< Control whether delay sample13 until a new sync input occurs. */
    uint32_t bitSample14 : 1U; /*!< Control whether delay sample14 until a new sync input occurs. */
    uint32_t bitSample15 : 1U; /*!< Control whether delay sample15 until a new sync input occurs. */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    uint32_t bitSample16 : 1U; /*!< Control whether delay sample16 until a new sync input occurs. */
    uint32_t bitSample17 : 1U; /*!< Control whether delay sample17 until a new sync input occurs. */
    uint32_t bitSample18 : 1U; /*!< Control whether delay sample18 until a new sync input occurs. */
    uint32_t bitSample19 : 1U; /*!< Control whether delay sample19 until a new sync input occurs. */
#endif                         /* FSL_FEATURE_CADC_RSLT2_COUNT */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    uint32_t bitsReserved : 12U; /*!< Reserved 12 bits. */
#else
    uint32_t bitsReserved : 16U;         /*!< Reserved 16 bits. */
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_scan_ctrl_seq_mode_t;

/*!
 * @brief Cadc scan control for simultaneous parallel scan mode.
 *
 * @note Each member of this structure represent one bit of the word.
 *      Asserted the structure's member means delay sample until a new sync input occurs.
 *      Cleared the structure's member means perform sample immediately after the completion
 *      of the current sample.
 *
 */
typedef struct _cadc_scan_ctrl_simultParallel_mode
{
    uint32_t bitSample0_8 : 1U;  /*!< Control whether delay sample0 and sample8 until a new sync input occurs. */
    uint32_t bitSample1_9 : 1U;  /*!< Control whether delay sample1 and sample9 until a new sync input occurs. */
    uint32_t bitSample2_10 : 1U; /*!< Control whether delay sample2 and sample10 until a new sync input occurs. */
    uint32_t bitSample3_11 : 1U; /*!< Control whether delay sample3 and sample11 until a new sync input occurs. */
    uint32_t bitsReserved1 : 4U; /*!< Reserved 4 bits. */
    uint32_t bitSample4_12 : 1U; /*!< Control whether delay sample4 and sample12 until a new sync input occurs. */
    uint32_t bitSample5_13 : 1U; /*!< Control whether delay sample5 and sample13 until a new sync input occurs. */
    uint32_t bitSample6_14 : 1U; /*!< Control whether delay sample6 and sample14 until a new sync input occurs. */
    uint32_t bitSample7_15 : 1U; /*!< Control whether delay sample7 and sample15 until a new sync input occurs. */
    uint32_t bitsReserved2 : 4U; /*!< Reserved 4 bits. */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    uint32_t bitSample16_18 : 1U; /*!< Control whether delay sample16 and sample18 until a new sync input occurs. */
    uint32_t bitSample17_19 : 1U; /*!< Control whether delay sample17 and sample19 until a new sync input occurs. */
#endif                            /* FSL_FEATURE_CADC_RSLT2_COUNT */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    uint32_t bitsReserved3 : 14U; /*!< Reserved 14 bits. */
#else
    uint32_t bitsReserved3 : 16U;        /*!< Reserved 16 bits. */
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_scan_ctrl_simultParallel_mode_t;

/*!
 * @brief The scan ctrl struture for converterA in independent scan mode.
 */
typedef struct _cadc_scan_ctrl_independent_parallel_mode_converterA
{
    uint32_t bitSample0 : 1U;    /*!< Control whether delay converterA's sample0 until
                                     a new sync input occurs. */
    uint32_t bitSample1 : 1U;    /*!< Control whether delay converterA's sample1 until
                                     a new sync input occurs. */
    uint32_t bitSample2 : 1U;    /*!< Control whether delay converterA's sample2 until
                                     a new sync input occurs. */
    uint32_t bitSample3 : 1U;    /*!< Control whether delay converterA's sample3 until
                                                a new sync input occurs. */
    uint32_t bitsReserved1 : 4U; /*!< Reserved 4 bits. */
    uint32_t bitSample4 : 1U;    /*!< Control whether delay converterA's sample4 until
                                     a new sync input occurs. */
    uint32_t bitSample5 : 1U;    /*!< Control whether delay converterA's sample5 until
                                     a new sync input occurs. */
    uint32_t bitSample6 : 1U;    /*!< Control whether delay converterA's sample6 until
                                     a new sync input occurs. */
    uint32_t bitSample7 : 1U;    /*!< Control whether delay converterA's sample7 until
                                                a new sync input occurs. */
    uint32_t bitsReserved2 : 4U; /*!< Reserved 4 bits */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    uint32_t bitSample16 : 1U;    /*!< Control whether delay converterA's sample16 until
                                      a new sync input occurs. */
    uint32_t bitSample17 : 1U;    /*!< Control whether delay converterA's sample17 until
                                                 a new sync input occurs. */
    uint32_t bitsReserved3 : 14U; /*!< Reserved 14 bits. */
#else
    uint32_t bitsReserved3 : 16U;        /*!< Reserved 16 bits. */
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_scan_ctrl_independent_parallel_mode_converterA_t;

/*!
 * @brief The scan ctrl struture for converterB in independent scan mode.
 */
typedef struct _cadc_scan_ctrl_independent_parallel_mode_converterB
{
    uint32_t bitsReserved1 : 4U; /*!< Reserved 4 bits. */
    uint32_t bitSample8 : 1U;    /*!< Control whether delay converterB's sample8 until
                                     a new sync input occurs. */
    uint32_t bitSample9 : 1U;    /*!< Control whether delay converterB's sample9 until
                                     a new sync input occurs. */
    uint32_t bitSample10 : 1U;   /*!< Control whether delay converterB's sample10 until
                                     a new sync input occurs. */
    uint32_t bitSample11 : 1U;   /*!< Control whether delay converterB's sample11 until
                                                a new sync input occurs. */
    uint32_t bitsReserved2 : 4U; /*!< Reserved 4 bits. */
    uint32_t bitSample12 : 1U;   /*!< Control whether delay converterB's sample12 until
                                     a new sync input occurs. */
    uint32_t bitSample13 : 1U;   /*!< Control whether delay converterB's sample13 until
                                     a new sync input occurs. */
    uint32_t bitSample14 : 1U;   /*!< Control whether delay converterB's sample14 until
                                     a new sync input occurs. */
    uint32_t bitSample15 : 1U;   /*!< Control whether delay converterB's sample15 until
                                                a new sync input occurs. */
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    uint32_t bitsReserved3 : 2U;  /*!< Reserved 2 bits. */
    uint32_t bitSample18 : 1U;    /*!< Control whether delay converterB's sample18 until
                                      a new sync input occurs. */
    uint32_t bitSample19 : 1U;    /*!< Control whether delay converterB's sample19 until
                                                 a new sync input occurs. */
    uint32_t bitsReserved4 : 12U; /*!< Reserved 12 bits. */
#else
    uint32_t bitsReserved3 : 16U;        /*!< Reserved 16 bits. */
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
} cadc_scan_ctrl_independent_parallel_mode_converterB_t;

/*!
 * @brief The union for converters in independent parallel mode.
 */
typedef union _cadc_scan_ctrl_independent_parallel_mode
{
    cadc_scan_ctrl_independent_parallel_mode_converterA_t sConverterA; /*!< Scan control for converterA. */
    cadc_scan_ctrl_independent_parallel_mode_converterB_t sConverterB; /*!< Scan control for converterB. */
} cadc_scan_ctrl_independent_parallel_mode_t;

/*!
 * @brief The union of the scan control for each scan mode.
 */
typedef union _cadc_scan_control
{
    uint32_t u32ScanCtrlVal;                              /*!< The 32 bits value of the scan control value. */
    cadc_scan_ctrl_seq_mode_t sSequential;                /*!< Scan control for sequential scan mode. */
    cadc_scan_ctrl_simultParallel_mode_t sSimultParallel; /*!< Scan control for simultaneous parallel scan mode. */
    cadc_scan_ctrl_independent_parallel_mode_t uIndependentParallel; /*!< Scan control for independent scan mode. */
} cadc_scan_control_t;

/*!
 * @brief The structure for configuring each converter.
 */
typedef struct _cadc_converter_config
{
    uint16_t u16ClockDivisor; /*!< Converter's clock divisor for the clock source. Available setting range is 0-63.
                                    - When the clockDivisor is 0, the divisor is 2.
                                    - For all other clockDivisor values, the divisor is 1 more than the decimal value of
                                        clockDivisor: clockDivisor + 1 */
#if !(defined(FSL_FEATURE_CADC_NO_SPEEDMODE_BIT) && FSL_FEATURE_CADC_NO_SPEEDMODE_BIT)
    cadc_speed_mode_t eSpeedMode;                                /*!< Converter's speed mode. */
#endif                                                           /* FSL_FEATURE_CADC_NO_SPEEDMODE_BIT */
    cadc_reference_voltage_source_t eHighReferenceVoltageSource; /*!< High voltage reference source. */
    cadc_reference_voltage_source_t eLowReferenceVoltageSource;  /*!< Low reference voltage source. */
#if !(defined(FSL_FEATURE_CADC_NO_SAMPLE_WINDOW) && FSL_FEATURE_CADC_NO_SAMPLE_WINDOW)
    uint16_t u16SampleWindowCount; /*!< Sample Window Count. Available setting range is 0-7. */
#endif                             /* FSL_FEATURE_CADC_NO_SAMPLE_WINDOW */
    bool bEnableDMA;               /*!< Enable/Disable DMA. */
    bool bPowerUp;                 /*!< Power up or power down the converter. */
    bool bScanInitBySync;          /*!< The member user to control the initiate method of the scan.
                                          - \b true Use a SYNC input pulse or START command to initiate a scan.
                                          - \b false  Scan is initiated by the assertion of START command only. */
} cadc_converter_config_t;

/*!
 * @brief The structure for configuring the Cyclic ADC's setting.
 */
typedef struct _cadc_config
{
    /* Common options. */
    cadc_idle_work_mode_t eIdleWorkMode;         /*!< Idle work mode for the module. */
    cadc_dma_trigger_source_t eDMATriggerSource; /*!<  Selects the dma trigger source for the module. */
    uint16_t u16PowerUpDelay;                    /*!< The number of ADC clocks to power up the converters
                                                      (if powered up), before allowing a scan to start.
                                                      The available range is 0 to 63 . */
    uint32_t u32EnabledInterruptMask;            /*!< The mask of the interrupts to be enabled,
                                                      should be the OR'ed value of @ref _cadc_interrupt. */

    /* The following 3 members define scan related options. */
    cadc_scan_mode_t eScanMode;                      /*!< The scan mode of the module. */
    cadc_sample_slot_disabled_t uDisabledSampleSlot; /*!< The member used to config the which sample slot is disabled
                                                              for the scan. The scan will continue until the first
                                                              disabled sample slot is encountered. */
    cadc_scan_control_t uScanControl;                /*!< Scan control provides the ability to pause and await a new
                                                              sync signal while current sample completed. */

