nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.h
    /* The following 2 members define channel related options. */
    uint32_t u32ChannelModeMask;                               /*!< The mask of each channel's mode, should be the
                                                                        OR'ed value of cadc_channel_mode_t.
                                                                        Each channel supports single-end and
                                                                        differential(Fully differentail and Unipolar
                                                                        differential). Some devices also support alternate
                                                                        source mode.
                                                                         */
    cadc_channel_gain_t eChannelGain[CADC_SAMPLE_SLOTS_COUNT]; /*!< The gain value for each channel. Each element of
                                                                        the array represents the gain of the channel.
                                                                        E.g.  eChannelGain[0] means channel gain of
                                                                         channel0, which is ANA0. */

    /* The following member defines sample Slot related options. */
    cadc_channel_number_t eSampleSlot[CADC_SAMPLE_SLOTS_COUNT]; /*!< The channel assigned to each sample slot. The
                                                                    index of the array represents sample slot index. */

    /* The following 2 members define converters related options. */
    cadc_converter_config_t sConverterA; /*!< The configuration for converterA. */
    cadc_converter_config_t sConverterB; /*!< The configuration for converterB. */
} cadc_config_t;

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

/*!
 * @name Initialization and deinitialization Interfaces
 * @{
 */

/*!
 * @brief Initializes the CADC module, such as scan mode, DMA trigger source, interrupt mask and so on.
 *
 * This function is to make the initialization for using CADC module.
 * The operations are:
 *  - Enable the clock for CADC.
 *  - Set power up delay and Idle work mode.
 *  - Set DMA trigger source.
 *  - Enable the interrupts(Including High/Low limit interrupt, zero crossing interrupt interrupt, end of scan interrupt
 *    and each sample slot's scan interrupt).
 *  - Set scan mode.
 *  - Set disabled sample slot for the scan.
 *  - Set scan control options.
 *  - Set selected channels' mode.
 *  - Set gain for each channel.
 *  - Config conterA and converterB.
 *
 * @note The high limit value, low limit value, offset value and zerocrossing mode of each sample slot
 * will not be configured in this function, to set those options, the APIs in "Sample Slot Control Interfaces"
 * function group can be used.
 *
 * @param base   CADC peripheral base address.
 * @param psConfig Pointer to configuration structure. See @ref cadc_config_t.
 */
void CADC_Init(ADC_Type *base, const cadc_config_t *psConfig);

/*!
 * @brief Gets an available pre-defined options(such as scan mode, DMA trigger source, interrupt mask and so on) for
 * module's configuration.
 *
 * This function initializes the module's configuration structure with an available settings.
 * The default value are:
 *  @code
        psConfig->eDMATriggerSource = kCADC_DMATrigSrcEndofScan;
        psConfig->eIdleWorkMode = kCADC_IdleKeepNormal;
        psConfig-s>u16PowerUpDelay = 26U;
        psConfig->u32EnabledInterruptMask = 0U;
        psConfig->eScanMode = kCADC_ScanModeTriggeredParallelSimultaneous;
        psConfig->uDisabledSampleSlot.u32SampleDisVal = 0xFF0F0UL;
        psConfig->uScanControl.u32ScanCtrlVal         = 0x0UL;
        psConfig->eChannelGain[x] = kCADC_SignalGainX1;
        psConfig->sampleSlotScanInterruptEnableMask = kCADC_NonSampleSlotMask;
        For the default setting of converter, please see CADC_GetConverterDefaultConfig().
    @endcode
 *
 * @param psConfig Pointer to configuration structure. See @ref cadc_config_t.
 */
void CADC_GetDefaultConfig(cadc_config_t *psConfig);

/*!
 * @brief De-initializes the CADC module, including power down both converter and disable the clock(Optional).
 *
 * This function is to make the de-initialization for using CADC module.
 * The operations are:
 *  - Power down both converter.
 *  - Disable the clock for CADC.
 *
 * @param base CADC peripheral base address.
 */
void CADC_Deinit(ADC_Type *base);

/* @} */

/*!
 * @name Scan related Interfaces
 * @{
 */

/*!
 * @brief Sets the scan mode(such as Sequential scan mode, Simultaneous parallel scan mode, Independent parallel scan
 * mode) of dual converters.
 *
 * @param base CADC peripheral base address.
 * @param eScanMode Dual converters' scan mode, please see @ref cadc_scan_mode_t for details.
 */
static inline void CADC_SetScanMode(ADC_Type *base, cadc_scan_mode_t eScanMode)
{
    if (eScanMode > kCADC_ScanModeTriggeredParallelIndependent)
    {
        base->CTRL1 = (((uint16_t)(base->CTRL1 & ~(ADC_CTRL1_SMODE_MASK))) | ADC_CTRL1_SMODE((uint8_t)eScanMode >> 4U));
        base->CTRL2 |= ADC_CTRL2_SIMULT_MASK;
    }
    else
    {
        base->CTRL1 = (((uint16_t)(base->CTRL1 & ~(ADC_CTRL1_SMODE_MASK))) | ADC_CTRL1_SMODE(eScanMode));
        base->CTRL2 &= ~(uint16_t)ADC_CTRL2_SIMULT_MASK;
    }
}

/*!
 * @brief The function provides the ability to pause and await new sync in the conversion sequence.
 *
 * @param base CADC peripheral base address.
 * @param uScanControl The scan control value, please refer to @ref cadc_scan_control_t for details.
 */
static inline void CADC_SetScanControl(ADC_Type *base, cadc_scan_control_t uScanControl)
{
    base->SCTRL = uScanControl.u32ScanCtrlVal & 0xFFFFUL;
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    base->SCTRL2 = (uScanControl.u32ScanCtrlVal & 0xF0000UL) >> 16U;
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/* @} */

/*!
 * @name Channel control Interfaces
 * @{
 */

/*!
 * @brief Sets mode for the specific channel(Each channel can be set as single-end, fully differential and unipolar
 * differential(Optional) mode).
 *
 * @param base CADC peripheral base address.
 * @param eChannelMode The channel mode to be set, please refer to @ref cadc_channel_mode_t for details.
 */
void CADC_SetChannelMode(ADC_Type *base, cadc_channel_mode_t eChannelMode);

/*!
 * @brief Sets the gain(Supports X1, X2, X4) of selected channel.
 *
 * @param base CADC peripheral base address.
 * @param eChannelNumber The number of channel, please refer to @ref cadc_channel_number_t.
 * @param eChannelGain The gain amplification, please refer to @ref cadc_channel_gain_t for details.
 */
void CADC_SetChannelGain(ADC_Type *base, cadc_channel_number_t eChannelNumber, cadc_channel_gain_t eChannelGain);

/* @} */

/*!
 * @name Sample Slot Control Interfaces
 * @{
 */

/*!
 * @brief Gets sample slot default configuration including zero crossing mode, high limit value, low limit value and
 * offset value.
 *
 * @code
        psConfig->eZeroCrossingMode = kCADC_ZeroCrossingDisabled;
        psConfig->u16HighLimitValue  = 0x7FF8U;
        psConfig->u16LowLimitValue   = 0x0U;
        psConfig->u16OffsetValue     = 0x0U;
    @endcode
 *
 * @param psConfig      Pointer to configuration structure. See @ref cadc_sample_slot_config_t.
 */
void CADC_GetSampleSlotDefaultConfig(cadc_sample_slot_config_t *psConfig);

/*!
 * @brief Configures the options(including zero crossing mode, high limit value, low limit value and offset value) for
 * sample slot.
 *
 * @note This function can be used to set high limit value, low limit value,
 * offset value and zerocrossing mode of the sample slot.
 *
 * @param base        CADC peripheral base address.
 * @param eSampleIndex Index of sample slot in conversion sequence. Please refer to @ref cadc_sample_slot_index_t.
 * @param psConfig      Pointer to configuration structure. See @ref cadc_sample_slot_config_t.
 */
void CADC_SetSampleSlotConfig(ADC_Type *base,
                              cadc_sample_slot_index_t eSampleIndex,
                              const cadc_sample_slot_config_t *psConfig);

/*!
 * @brief Sets zero-crossing mode for the selected sample slot.
 *
 * @param base CADC peripheral base address.
 * @param eSampleIndex The index of sample slot. Please refer to @ref cadc_sample_slot_index_t for details.
 * @param eZeroCrossingMode Zero crossing mode, please refer to @ref cadc_sample_slot_zero_crossing_mode_t for details.
 */
void CADC_SetSampleSlotZeroCrossingMode(ADC_Type *base,
                                        cadc_sample_slot_index_t eSampleIndex,
                                        cadc_sample_slot_zero_crossing_mode_t eZeroCrossingMode);

/*!
 * @brief Routes the channel to the sample slot.
 *
 * @param base CADC peripheral base address.
 * @param eSampleIndex The index of sample slot, please refer to @ref cadc_sample_slot_index_t for details.
 * @param eChannelNumber Sample channel number, please refer to @ref cadc_channel_number_t for details.
 */
void CADC_RouteChannelToSampleSlot(ADC_Type *base,
                                   cadc_sample_slot_index_t eSampleIndex,
                                   cadc_channel_number_t eChannelNumber);

/*!
 * @brief Sets the low limit value(-32768 ~ 32767 with lower three bits of fixed value 0) for the specific sample slot.
 *
 * @param base CADC peripheral base address.
 * @param eSampleIndex The index of sample slot. Please refer to @ref cadc_sample_slot_index_t for details.
 * @param u16LowLimitValue Low limit value(-32768 ~ 32767 with lower three bits of fixed value 0). Original value
 * formation as hardware register, with 3-bits left shifted.
 */
static inline void CADC_SetSampleSlotLowLimitValue(ADC_Type *base,
                                                   cadc_sample_slot_index_t eSampleIndex,
                                                   uint16_t u16LowLimitValue)
{
    if ((uint16_t)eSampleIndex < ADC_RSLT_COUNT)
    {
        base->LOLIM[(uint16_t)eSampleIndex] = u16LowLimitValue;
    }
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    else
    {
        base->LOLIM2[(uint16_t)eSampleIndex - ADC_RSLT_COUNT] = u16LowLimitValue;
    }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Sets the high limit value(-32768 ~ 32767 with lower three bits of fixed value 0) for the specific sample slot.
 *
 * @param base CADC peripheral base address.
 * @param eSampleIndex The index of sample slot. Please refer to @ref cadc_sample_slot_index_t for details.
 * @param u16HighLimitValue High limit value(-32768 ~ 32767 with lower three bits of fixed value 0). Original value
 * formation as hardware register, with 3-bits left shifted.
 */
static inline void CADC_SetSampleSlotHighLimitValue(ADC_Type *base,
                                                    cadc_sample_slot_index_t eSampleIndex,
                                                    uint16_t u16HighLimitValue)
{
    if ((uint16_t)eSampleIndex < ADC_RSLT_COUNT)
    {
        base->HILIM[(uint16_t)eSampleIndex] = u16HighLimitValue;
    }
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    else
    {
        base->HILIM2[(uint16_t)eSampleIndex - ADC_RSLT_COUNT] = u16HighLimitValue;
    }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Sets the offset value(-32768 ~ 32767 with lower three bits of fixed value 0) for the specific sample slot.
 *
 * @param base CADC peripheral base address.
 * @param eSampleIndex The index of sample slot. Please refer to @ref cadc_sample_slot_index_t for details.
 * @param u16OffsetValue Offset value(-32768 ~ 32767 with lower three bits of fixed value 0). Original value formation
 * as hardware register, with 3-bits left shifted.
 */
static inline void CADC_SetSampleSlotOffsetValue(ADC_Type *base,
                                                 cadc_sample_slot_index_t eSampleIndex,
                                                 uint16_t u16OffsetValue)
{
    if ((uint16_t)eSampleIndex < ADC_RSLT_COUNT)
    {
        base->OFFST[(uint16_t)eSampleIndex] = u16OffsetValue;
    }
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U))
    else
    {
        base->OFFST2[(uint16_t)eSampleIndex - ADC_RSLT_COUNT] = u16OffsetValue;
    }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Gets the sample result value.
 *
 * This function is to get the sample result value. The returned value keeps it original formation just like in
 * hardware result register. It includes the sign bit as the MSB and 3-bit left shifted value.
 *
 * @param  base        CADC peripheral base address.
 * @param  eSampleIndex Index of sample slot. For the counts of sample slots,
 *                     please refer to @ref cadc_sample_slot_index_t for details.
 * @return Sample's conversion value.
 */
static inline uint16_t CADC_GetSampleSlotResultValue(ADC_Type *base, cadc_sample_slot_index_t eSampleIndex)
{
    uint16_t u16Ret;

    if ((uint16_t)eSampleIndex < ADC_RSLT_COUNT)
    {
        u16Ret = (uint16_t)(base->RSLT[(uint16_t)eSampleIndex]);
    }
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    else
    {
        u16Ret = (uint16_t)(base->RSLT2[((uint16_t)eSampleIndex - ADC_RSLT_COUNT)]);
    }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
    return u16Ret;
}
/* @} */

/*!
 * @name Converters Control Interfaces
 * @{
 */

/*!
 * @brief Gets available pre-defined settings(such as clock divisor, reference voltage source, and so on) for each
 * converter's configuration.
 *
 * This function initializes each converter's configuration structure with an available settings.
 * The default value are:
 * @code
        psConfig->u16ClockDivisor = 4U;(ADC clock = Peripheral clock / 5)
        psConfig->eSpeedMode = kCADC_SpeedMode0; (Chip specific)
        psConfig->eHighReferenceVoltageSource = kCADC_ReferenceVoltageVrefPad;
        psConfig->eLowReferenceVoltageSource = kCADC_ReferenceVoltageVrefPad;
        psConfig->u16SampleWindowCount = 0U; (Chip specific)
        psConfig->bEnableDMA         = false;
        psConfig->bPowerUp   = false;
        psConfig->bScanInitBySync  = true;
    @endcode
 * @param psConfig Pointer to configuration structure. See @ref cadc_converter_config_t.
 */
void CADC_GetConverterDefaultConfig(cadc_converter_config_t *psConfig);

/*!
 * @brief Configures the options(such as clock divisor, reference voltage source, and so on) for the converter.
 *
 * This function can be used to configure the converter
 * The operations are:
 *  - Set clock divisor;
 *  - Set reference voltage source
 *  - Enable/Disable DMA
 *  - Power-up/power-down converter
 *
 * @param base          CADC peripheral base address.
 * @param eConverterId The converter Id. See @ref cadc_converter_id_t.
 * @param psConfig        Pointer to configuration structure. See @ref cadc_converter_config_t.
 */
void CADC_SetConverterConfig(ADC_Type *base, cadc_converter_id_t eConverterId, const cadc_converter_config_t *psConfig);

/*!
 * @brief Changes the converter to stop mode or normal mode.
 *
 * The conversion should only be launched after the converter is in normal mode. When in stop mode, the current scan is
 * stopped and no further scans can start. All the software trigger and hardware trigger are ignored.
 *
 * @param base          CADC peripheral base address.
 * @param eConverterId The converter Id. See @ref cadc_converter_id_t.
 * @param bEnable       Used to change the operation mode.
 *                      - \b true Changed to normal mode.
 *                      - \b false Changed to stop mode
 */
static inline void CADC_EnableConverter(ADC_Type *base, cadc_converter_id_t eConverterId, bool bEnable)
{
    /* For converter A. */
    if (kCADC_ConverterA == eConverterId)
    {
        if (bEnable)
        {
            base->CTRL1 &= ~(uint16_t)ADC_CTRL1_STOP0_MASK; /* Clear STOP to enable. */
        }
        else
        {
            base->CTRL1 |= ADC_CTRL1_STOP0_MASK;
        }
    }
    /* For converter B. */
    else if (kCADC_ConverterB == eConverterId)
    {
        if (bEnable)
        {
            base->CTRL2 &= ~(uint16_t)ADC_CTRL2_STOP1_MASK; /* Clear STOP to enable. */
        }
        else
        {
            base->CTRL2 |= ADC_CTRL2_STOP1_MASK;
        }
    }
}

/*!
 * @brief Enables/Disables the external sync input pulse to initiate a scan.
 *
 * @note When in "Once" scan mode, this gate would be off automatically after an available sync is received. User needs
 * to enable the input again manually if another sync signal is wanted.
 *
 * @param base          CADC peripheral base address.
 * @param eConverterId The converter Id. See @ref cadc_converter_id_t.
 * @param bEnable        Enable the feature or not.
 *                      - \b true Used a SYNC input pulse or START command to initiate a scan.
 *                      - \b false Only use the START command to initiate a scan.
 */
static inline void CADC_EnableConverterSyncInput(ADC_Type *base, cadc_converter_id_t eConverterId, bool bEnable)
{
    /* For converter A. */
    if (kCADC_ConverterA == eConverterId)
    {
        if (bEnable)
        {
            base->CTRL1 |= ADC_CTRL1_SYNC0_MASK;
        }
        else
        {
            base->CTRL1 &= ~(uint16_t)ADC_CTRL1_SYNC0_MASK;
        }
    }
    /* For converter B. */
    else if (kCADC_ConverterB == eConverterId)
    {
        if (bEnable)
        {
            base->CTRL2 |= ADC_CTRL2_SYNC1_MASK;
        }
        else
        {
            base->CTRL2 &= ~(uint16_t)ADC_CTRL2_SYNC1_MASK;
        }
    }
}

/*!
 * @brief Uses software trigger to start a conversion sequence.
 *
 * This function is to do the software trigger to the converter. The software trigger can used to start a conversion
 * sequence.
 *
 * @param base          CADC peripheral base address.
 * @param eConverterId The ID of the converter to be started. See @ref cadc_converter_id_t.
 */
static inline void CADC_DoSoftwareTriggerConverter(ADC_Type *base, cadc_converter_id_t eConverterId)
{
    /* For converter A. */
    if (kCADC_ConverterA == eConverterId)
    {
        base->CTRL1 |= ADC_CTRL1_START0_MASK;
    }
    /* For converter B. */
    else if (kCADC_ConverterB == eConverterId)
    {
        base->CTRL2 |= ADC_CTRL2_START1_MASK;
    }
}

/*!
 * @brief Sets clock divisor(Range from 0 to 63) for converterA and conveter B.
 *
 * @param base CADC peripheral base address.
 * @param eConverterId The converter Id. See @ref cadc_converter_id_t.
 * @param u16ClockDivisor Converter's clock divisor for the clock source.Available setting range is 0-63.
 *                           - When the clockDivisor is 0, the divisor is 2.
 *                           - For all other clockDivisor values, the divisor is 1 more than the decimal value of
 *                               clockDivisor: clockDivisor + 1
 */
static inline void CADC_SetConverterClockDivisor(ADC_Type *base,
                                                 cadc_converter_id_t eConverterId,
                                                 uint16_t u16ClockDivisor)
{
    /* For converter A. */
    if (kCADC_ConverterA == eConverterId)
    {
        base->CTRL2 = ((base->CTRL2 & (~(uint16_t)ADC_CTRL2_DIV0_MASK)) | ADC_CTRL2_DIV0(u16ClockDivisor));
    }
    /* For converter B. */
    else if (kCADC_ConverterB == eConverterId)
    {
        base->PWR2 = (base->PWR2 & (uint16_t)(~ADC_PWR2_DIV1_MASK)) | ADC_PWR2_DIV1(u16ClockDivisor);
    }
}

/*!
 * @brief Sets converter's reference voltage source(Including high reference voltage source and low reference voltage
 * source).
 *
 * @param base CADC peripheral base address.
 * @param eConverterId The converter Id. See @ref cadc_converter_id_t.
 * @param eHighReferenceVoltage High voltage reference source, please refer to @ref cadc_reference_voltage_source_t.
 * @param eLowReferenceVoltage  Low voltage reference source, please refer to @ref cadc_reference_voltage_source_t.
 */
void CADC_SetConverterReferenceVoltageSource(ADC_Type *base,
                                             cadc_converter_id_t eConverterId,
                                             cadc_reference_voltage_source_t eHighReferenceVoltage,
                                             cadc_reference_voltage_source_t eLowReferenceVoltage);

/*!
 * @brief Powers up/down the specific converter.
 *
 * This function is to enable the power for the converter. The converter should be powered up before the conversion.
 * Once this API is called to power up the converter, the converter would be powered on after a few moment (so-called
 * power up delay, the function CADC_SetPowerUpDelay() can be used to set the power up delay), so that the power would
 * be stable.
 *
 * @param base          CADC peripheral base address.
 * @param eConverterId The converter to be powered. See @ref cadc_converter_id_t.
 * @param bEnable       Powers up/down the converter.
 *                      - \b true Power up the specific converter.
 *                      - \b false Power down the specific converter.
 */
void CADC_EnableConverterPower(ADC_Type *base, cadc_converter_id_t eConverterId, bool bEnable);

/*!
 * @brief Enables/Disables the converter's DMA feature.
 *
 * @param base          CADC peripheral base address.
 * @param eConverterId  The converter id. See @ref cadc_converter_id_t.
 * @param bEnable        Enables/Disables the DMA.
 *                       - \b true Enable the converter's DMA.
 *                       - \b false Disable the converter's DMA.
 */
static inline void CADC_EnableConverterDMA(ADC_Type *base, cadc_converter_id_t eConverterId, bool bEnable)
{
    /* For converter A. */
    if (kCADC_ConverterA == eConverterId)
    {
        if (bEnable)
        {
            base->CTRL1 |= ADC_CTRL1_DMAEN0_MASK;
        }
        else
        {
            base->CTRL1 &= ~(uint16_t)ADC_CTRL1_DMAEN0_MASK;
        }
    }
    /* For converter B. */
    else if (kCADC_ConverterB == eConverterId)
    {
        if (bEnable)
        {
            base->CTRL2 |= ADC_CTRL2_DMAEN1_MASK;
        }
        else
        {
            base->CTRL2 &= ~(uint16_t)ADC_CTRL2_DMAEN1_MASK;
        }
    }
}

/* @} */

/*!
 * @name Power Control Interfaces
 * @{
 */

/*!
 * @brief Sets power up delay(The number of ADC clocks to power up the converters before allowing a scan to start).
 *
 * @param base CADC peripheral base address.
 * @param u16PowerUpDelay The number of ADC clocks to power up an ADC converter. Ranges from 0 to 63.
 */
static inline void CADC_SetPowerUpDelay(ADC_Type *base, uint16_t u16PowerUpDelay)
{
    base->PWR = ((base->PWR & (uint16_t)(~ADC_PWR_PUDELAY_MASK)) | ADC_PWR_PUDELAY(u16PowerUpDelay));
}

/*!
 * @brief Enables/Disables auto-powerdown converters when the module is not in use for a scan.
 *
 * @param base CADC peripheral base address.
 * @param bEnable Enable/Disable auto-powerdown mode.
 *                - \b true Enable auto-powerdown mode, so when the module is not in use, it will auto-powerdown.
 *                - \b false Disable auto-powerdown mode, so when the module is not in use, the power will still on.
 */
static inline void CADC_EnableAutoPowerDownMode(ADC_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->PWR |= ADC_PWR_APD_MASK;
    }
    else
    {
        base->PWR &= (~(uint16_t)ADC_PWR_APD_MASK);
    }
}

/* @} */

/*!
 * @name DMA Control Interfaces
 * @{
 */

