nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cadc.h
/*!
 * @brief Sets DMA trigger source(available selections are "End of scan" and "Sample Ready").
 *
 * @param base CADC peripheral base address.
 * @param eDMATriggerSource DMA trigger source. Please refer to @ref cadc_dma_trigger_source_t for details.
 */
static inline void CADC_SetDMATriggerSource(ADC_Type *base, cadc_dma_trigger_source_t eDMATriggerSource)
{
    if (kCADC_DMATrigSrcSampleReady == eDMATriggerSource)
    {
        base->CTRL3 |= ADC_CTRL3_DMASRC_MASK;
    }
    else /* kCADCDmaTriggerSourceAsEndOfScan. */
    {
        base->CTRL3 &= ~(uint16_t)ADC_CTRL3_DMASRC_MASK;
    }
}

/* @} */

/*!
 * @name Interrupt Control Interfaces
 * @{
 */

/*!
 * @brief Enables the interrupts(such as high/low limit interrupts, end of scan interrupts, and so on).
 *
 * @param base CADC peripheral base address.
 * @param u32Mask Mask value for converters interrupt events. Should be the OR'ed value of @ref _cadc_interrupt_enable.
 */
static inline void CADC_EnableInterrupts(ADC_Type *base, uint32_t u32Mask)
{
    if ((u32Mask & 0xFFFFUL) != 0UL)
    {
        base->SCHLTEN |= (uint16_t)(u32Mask & 0xFFFFUL);
    }
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    if ((u32Mask & 0xF0000UL) != 0UL)
    {
        base->SCHLTEN2 |= (uint16_t)((u32Mask & 0xF0000UL) >> 16UL);
    }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
    if ((u32Mask & 0xF000000UL) != 0UL)
    {
        base->CTRL1 |= (uint16_t)((u32Mask & 0xF000000UL) >> 16UL);
    }
    if ((u32Mask & 0xF00000UL) != 0UL)
    {
        base->CTRL2 |= (uint16_t)((u32Mask & 0xF00000UL) >> 12UL);
    }
}

/*!
 * @brief Disables the interrupts(such as high/low limit interrupts, end of scan interrupts, and so on).
 *
 * @param base CADC peripheral base address.
 * @param u32Mask Mask value for converts interrupt events. Should be the OR'ed value of @ref _cadc_interrupt_enable.
 */
static inline void CADC_DisableInterrupts(ADC_Type *base, uint32_t u32Mask)
{
    if ((u32Mask & 0xFFFFUL) != 0UL)
    {
        base->SCHLTEN &= (uint16_t) ~(u32Mask & 0xFFFFUL);
    }
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    if ((u32Mask & 0xF0000UL) != 0UL)
    {
        base->SCHLTEN2 &= (uint16_t) ~((u32Mask & 0xF0000UL) >> 16UL);
    }
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
    if ((u32Mask & 0xF000000UL) != 0UL)
    {
        base->CTRL1 &= (uint16_t) ~((u32Mask & 0xF000000UL) >> 16UL);
    }
    if ((u32Mask & 0xF00000UL) != 0UL)
    {
        base->CTRL2 &= (uint16_t) ~((u32Mask & 0xF00000UL) >> 12UL);
    }
}

/* @} */

/*!
 * @name ADC Status Flag Interfaces
 * @{
 */
/*!
 * @brief  Gets Miscellaneous status flags, such as end of scan status flag, high/low limit interrupt flags and so on.
 *
 * @note This API will return the current status of the ADC module, including high limit interrupt status,
 * low limit status flag, zero crossing interrupt status, End of scan interrupt status, conversion in progress status.
 * But some status flags are not included in this function. To get sample slot ready status flag, please invoking
 * CADC_GetSampleSlotReadyStatusFlags(), to get sample slot limit violations status please invoking
 * CADC_ClearSampleSlotLowLimitStatusFlags() and CADC_GetSampleSlotHighLimitStatusFlags(), to get zerocrossing status
 * please invoking CADC_GetSampleSlotZeroCrossingStatusFlags(). To get converters' power status please invoke
 * CADC_GetPowerStatusFlag().
 *
 * @param  base CADC peripheral base address.
 * @return Mask value for the event flags. See @ref _cadc_misc_status_flags.
 */
static inline uint16_t CADC_GetMiscStatusFlags(ADC_Type *base)
{
    return ((base->STAT) & 0xFF00U);
}

/*!
 * @brief Clears Miscellaneous status flags(Only for "end of scan" status flags).
 *
 * @note Only kCADC_ConverterAEndOfScanFlag and kCADC_ConverterBEndOfScanFlag can be cleared. And sample slot related
 * status flags can not be cleared in this function. To clear the status flags of limit violations, please invoking
 * CADC_ClearSampleSlotLowLimitStatusFlags() and CADC_ClearSampleSlotHighLimitStatusFlags(), to clear the status flags
 * of zero crossing mode, please invoking CADC_ClearSampleSlotZeroCrossingStatusFlags().
 *
 * @param base  CADC peripheral base address.
 * @param flags Mask value for the event flags to be cleared. See @ref _cadc_misc_status_flags.
 *              Only the enumeration @ref kCADC_ConverterAEndOfScanFlag and @ref kCADC_ConverterBEndOfScanFlag are
 *              useful.
 */
static inline void CADC_ClearMiscStatusFlags(ADC_Type *base, uint16_t u16Flags)
{
    base->STAT = (u16Flags & 0x1800U);
}

/*!
 * @brief Gets sample slots ready status flag, those status flags are cleared by reading the corresponding sample slots'
 *  result.
 *
 * @param base CADC peripheral base address.
 */
static inline uint32_t CADC_GetSampleSlotReadyStatusFlags(ADC_Type *base)
{
#if (defined(FSL_FEATURE_CADC_RSLT2_COUNT) && FSL_FEATURE_CADC_RSLT2_COUNT)
    return (uint32_t)(((uint32_t)(ADC_RDY_RDY_MASK & base->RDY) & 0xFFFFUL) |
                      ((((uint32_t)(base->RDY2 & ADC_RDY2_RDY_MASK)) << 16UL) & 0xFFFF0000UL));
#else
    return (ADC_RDY_RDY_MASK & base->RDY);
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Gets sample slot low limit status flags(Each bit represents one sample slot).
 *
 * @param base CADC peripheral base address.
 * @return The value of all sample slots' low limit status. Each bit represents one sample slot.
 */
static inline uint32_t CADC_GetSampleSlotLowLimitStatusFlags(ADC_Type *base)
{
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    return (uint32_t)(((ADC_LOLIMSTAT_LLS_MASK & base->LOLIMSTAT) & 0xFFFFUL) |
                      ((((uint32_t)(base->LOLIMSTAT2 & ADC_LOLIMSTAT2_LLS_MASK)) << ADC_RSLT_COUNT) & 0xFFFF0000UL));
#else
    return (uint32_t)(ADC_LOLIMSTAT_LLS_MASK & base->LOLIMSTAT);
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Clears sample slot's low limit status flags(Each bit represents one sample slot).
 *
 * @param base CADC peripheral base address.
 * @param u32SampleMask Mask value of sample slots. This parameter should be the OR'ed value of @ref
 * cadc_sample_slot_mask_t.
 */
static inline void CADC_ClearSampleSlotLowLimitStatusFlags(ADC_Type *base, uint32_t u32SampleMask)
{
    base->LOLIMSTAT = ADC_LOLIMSTAT_LLS(u32SampleMask & 0xFFFFU);
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    base->LOLIMSTAT2 = ADC_LOLIMSTAT2_LLS((u32SampleMask >> ADC_RSLT_COUNT) & 0xFFFFU);
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Gets sample slot high limit status flags(Each bit represents one sample slot).
 *
 * @param base CADC peripheral base address.
 * @return The value of all sample slots' high limit status. Each bit represents each sample slot.
 */
static inline uint32_t CADC_GetSampleSlotHighLimitStatusFlags(ADC_Type *base)
{
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    return (uint32_t)(((ADC_HILIMSTAT_HLS_MASK & base->HILIMSTAT) & 0xFFFFUL) |
                      ((((uint32_t)(base->HILIMSTAT2 & ADC_HILIMSTAT2_HLS_MASK)) << ADC_RSLT_COUNT) & 0xFFFF0000UL));
#else
    return (uint32_t)(ADC_HILIMSTAT_HLS_MASK & base->HILIMSTAT);
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Clears sample slot's high limit status flags(Each bit represents one sample slot).
 *
 * @param base CADC peripheral base address.
 * @param u32SampleMask Mask value of sample slots. This parameter should be the OR'ed value of @ref
 * cadc_sample_slot_mask_t.
 */
static inline void CADC_ClearSampleSlotHighLimitStatusFlags(ADC_Type *base, uint32_t u32SampleMask)
{
    base->HILIMSTAT = ADC_HILIMSTAT_HLS(u32SampleMask & 0xFFFFU);
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    base->HILIMSTAT2 = ADC_HILIMSTAT2_HLS((u32SampleMask >> ADC_RSLT_COUNT) & 0xFFFFU);
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Gets sample slot zero crossing status flags(Each bit represents one sample slot).
 *
 * @param base CADC peripheral base address.
 * @return The value of all sample slots' zero crossing status. Each bit represents each sample slot.
 */
static inline uint32_t CADC_GetSampleSlotZeroCrossingStatusFlags(ADC_Type *base)
{
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    return (uint32_t)(((ADC_ZXSTAT_ZCS_MASK & base->ZXSTAT) & 0xFFFFUL) |
                      ((((uint32_t)(base->ZXSTAT2 & ADC_ZXSTAT2_ZCS_MASK)) << ADC_RSLT_COUNT) & 0xFFFF0000UL));
#else
    return (uint32_t)(ADC_ZXSTAT_ZCS_MASK & base->ZXSTAT);
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Clears sample slot's zero crossing status flags(Each bit represents one sample slot).
 *
 * @param base CADC peripheral base address.
 * @param u32SampleMask Mask value of sample slots. This parameter should be the OR'ed value of @ref
 * cadc_sample_slot_mask_t.
 */
static inline void CADC_ClearSampleSlotZeroCrossingStatusFlags(ADC_Type *base, uint32_t u32SampleMask)
{
    base->ZXSTAT = ADC_ZXSTAT_ZCS(u32SampleMask & 0xFFFFU);
#if ((defined(FSL_FEATURE_CADC_RSLT2_COUNT) && (FSL_FEATURE_CADC_RSLT2_COUNT == 4U)))
    base->ZXSTAT2 = ADC_ZXSTAT2_ZCS((u32SampleMask >> ADC_RSLT_COUNT) & 0xFFFFU);
#endif /* FSL_FEATURE_CADC_RSLT2_COUNT */
}

/*!
 * @brief Gets converters power status(Those power status can not be cleared).
 *
 * @param base CADC peripheral base address.
 * @return The mask value of the converters' power status flag, see @ref _cadc_converter_power_status_flags.
 */
static inline uint16_t CADC_GetPowerStatusFlags(ADC_Type *base)
{
    return (base->PWR & (ADC_PWR_PSTS0_MASK | ADC_PWR_PSTS1_MASK));
}

/* @} */

#if defined(__cplusplus)
}
#endif
/*!
 * @}
 */
#endif /* _FSL_CADC_H_ */
